Test_Output.txt


Trie-CLI> help

--- Available Commands ---
  **insert <word>** : Add a new word to the dictionary.
  **search <word>** : Check if a word exists.
  **prefix <p>** : Check if any word starts with prefix 'p'.
  **auto <p>** : Get auto-completion suggestions for prefix 'p'.
  **spell <word>** : Get spelling corrections (1-edit distance).
  **help** : Show this command list.
  **exit** : Quit the program.
-------------------------------------------------------

Trie-CLI> search PROJECT
 'project' found in the dictionary.

Trie-CLI> insert computerize
'computerize' inserted successfully.

Trie-CLI> auto c
--- Autocomplete Suggestions for 'c' (6 found) ---
cat, car, cart, computer, commuter, code
-------------------------------------------------------

Trie-CLI> auto pro
--- Autocomplete Suggestions for 'pro' (4 found) ---
programming, project, programmer, program
-------------------------------------------------------

Trie-CLI> auto a
--- Autocomplete Suggestions for 'a' (5 found) ---
apple, apply, appetizer
... and 2 more. Use a longer prefix to narrow results.
-------------------------------------------------------

Trie-CLI> spell comuter # Deletion error (missing 'm')
--- Spell Check for 'comuter' ---
Suggestions (1-edit distance): commuter, computer
-------------------------------------------------------

Trie-CLI> spell appple # Transposition/Replace/Delete error
--- Spell Check for 'appple' ---
Suggestions (1-edit distance): apple
-------------------------------------------------------

Trie-CLI> spell computerize
--- Spell Check for 'computerize' ---
'computerize' is spelled correctly!
-------------------------------------------------------

Trie-CLI> exit
Exiting application. Goodbye! ðŸ‘‹

